MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/PIC24EP512GU810/hal_ll_pps_connection_defs.h
/****************************************************************************
**
** Copyright (C) ${COPYRIGHT_YEAR} MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** OF MERCHANTABILITY, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
** TO THE WARRANTIES FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/
/*!
 * @file  hal_ll_pps_connection_defs.h
 * @brief This file contains pps maps per chip for LOW LEVEL HAL PPS
 *        implementation for PIC24EP512GU810.
 */

#ifndef _HAL_LL_PPS_CONNECTION_DEFS_H_
#define _HAL_LL_PPS_CONNECTION_DEFS_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include "hal_ll_pps_struct_def.h"

/**
 * NOTE:
 * This macro is used for pins that do not have adequate PPS
 * registers according to datasheet.
 */
#define INVALID_PPS_ADDRESS (0) // TODO

// -------------------------------------------------------------

/*!< @brief PPS INPUT FUNCTIONS */
static const hal_ll_pps_pin_map_t hal_ll_pps_input_map[] =
{
    // --------- CAN --------- //
    #ifdef CAN1_RX_RG15_RP127
    {15, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 127, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG15_RP127
    {15, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 127, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE5_RP85
    {5, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 85, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE5_RP85
    {5, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 85, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE7_RP87
    {7, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 87, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE7_RP87
    {7, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 87, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG6_RP118
    {6, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 118, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG6_RP118
    {6, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 118, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG8_RP120
    {8, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 120, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG8_RP120
    {8, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 120, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF13_RP109
    {13, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 109, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF13_RP109
    {13, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 109, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF12_RP108
    {12, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 108, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF12_RP108
    {12, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 108, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD15_RP79
    {15, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 79, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD15_RP79
    {15, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 79, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF4_RP100
    {4, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 100, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF4_RP100
    {4, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 100, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF5_RP101
    {5, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 101, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF5_RP101
    {5, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 101, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF3_RP99
    {3, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 99, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF3_RP99
    {3, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 99, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF2_RP98
    {2, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 98, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF2_RP98
    {2, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 98, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF8_RP104
    {8, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 104, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF8_RP104
    {8, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 104, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD0_RP64
    {0, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 64, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD0_RP64
    {0, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 64, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD1_RP65
    {1, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 65, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD1_RP65
    {1, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 65, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD2_RP66
    {2, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 66, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD2_RP66
    {2, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 66, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD3_RP67
    {3, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 67, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD3_RP67
    {3, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 67, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD4_RP68
    {4, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 68, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD4_RP68
    {4, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 68, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD5_RP69
    {5, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 69, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD5_RP69
    {5, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 69, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD6_RP70
    {6, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 70, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD6_RP70
    {6, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 70, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD7_RP71
    {7, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 71, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD7_RP71
    {7, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 71, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF0_RP96
    {0, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 96, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF0_RP96
    {0, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 96, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF1_RP97
    {1, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 97, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF1_RP97
    {1, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 97, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG1_RP113
    {1, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 113, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG1_RP113
    {1, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 113, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG0_RP112
    {0, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 112, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG0_RP112
    {0, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 112, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE0_RP80
    {0, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 80, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE0_RP80
    {0, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 80, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG14_RP126
    {14, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 126, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG14_RP126
    {14, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 126, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG13_RP125
    {13, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 125, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG13_RP125
    {13, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 125, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE2_RP82
    {2, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 82, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE2_RP82
    {2, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 82, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE4_RP84
    {4, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 84, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE4_RP84
    {4, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 84, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE6_RPI86
    {6, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 86, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE6_RPI86
    {6, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 86, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RC1_RPI49
    {1, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 49, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RC1_RPI49
    {1, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 49, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RC2_RPI50
    {2, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 50, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RC2_RPI50
    {2, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 50, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RC3_RPI51
    {3, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 51, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RC3_RPI51
    {3, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 51, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RC4_RPI52
    {4, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 52, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RC4_RPI52
    {4, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 52, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG7_RPI119
    {7, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 119, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG7_RPI119
    {7, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 119, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG9_RPI121
    {9, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 121, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG9_RPI121
    {9, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 121, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RA0_RPI16
    {0, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 16, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RA0_RPI16
    {0, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 16, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE8_RPI88
    {8, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 88, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE8_RPI88
    {8, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 88, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE9_RPI89
    {9, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 89, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE9_RPI89
    {9, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 89, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB5_RPI37
    {5, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 37, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB5_RPI37
    {5, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 37, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB4_RPI36
    {4, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 36, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB4_RPI36
    {4, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 36, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB3_RPI35
    {3, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 35, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB3_RPI35
    {3, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 35, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB2_RPI34
    {2, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 34, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB2_RPI34
    {2, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 34, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB1_RPI33
    {1, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 33, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB1_RPI33
    {1, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 33, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB0_RPI32
    {0, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 32, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB0_RPI32
    {0, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 32, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB6_RPI38
    {6, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 38, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB6_RPI38
    {6, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 38, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB7_RPI39
    {7, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 39, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB7_RPI39
    {7, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 39, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB8_RPI40
    {8, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 40, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB8_RPI40
    {8, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 40, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB9_RPI41
    {9, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 41, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB9_RPI41
    {9, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 41, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB10_RPI42
    {10, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 42, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB10_RPI42
    {10, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 42, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB11_RPI43
    {11, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 43, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB11_RPI43
    {11, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 43, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RA1_RPI17
    {1, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 17, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RA1_RPI17
    {1, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 17, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB12_RPI44
    {12, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 44, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB12_RPI44
    {12, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 44, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB13_RPI45
    {13, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 45, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB13_RPI45
    {13, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 45, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB14_RPI46
    {14, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 46, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB14_RPI46
    {14, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 46, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB15_RPI47
    {15, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 47, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB15_RPI47
    {15, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 47, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD14_RPI78
    {14, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 78, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD14_RPI78
    {14, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 78, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RA2_RPI18
    {2, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 18, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RA2_RPI18
    {2, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 18, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RA3_RPI19
    {3, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 19, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RA3_RPI19
    {3, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 19, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RA4_RPI20
    {4, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 20, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RA4_RPI20
    {4, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 20, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RA5_RPI21
    {5, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 21, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RA5_RPI21
    {5, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 21, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RC12_RPI60
